[
    {
        "code": "FLS 1000",
        "credits": 6,
        "description": "Le test est offert pendant les périodes d'inscription selon un calendrier déterminé par l'Institut des langues secondes. Dans tous les cas, les étudiants et étudiantes doivent prendre rendez-vous en s'adressant à l'Institut des langues secondes quelques jours avant la session de testing. Dans le cas où serait constaté un écart significatif entre les résultats d'un étudiant ou d'une étudiante au test de compétence et ses aptitudes réelles dans la langue seconde, l'Institut des langues secondes se réserve le droit d'exiger une évaluation additionnelle. / Le test est offert pendant les périodes d'inscription selon un calendrier déterminé par l'Institut des langues secondes. Dans tous les cas, les étudiants et étudiantes doivent prendre rendez-vous en s'adressant à l'Institut des langues secondes quelques jours avant la session de testing.  Dans le cas où serait constaté un écart significatif entre les résultats d'un étudiant ou d'une étudiante au test de compétence et ses aptitudes réelles dans la langue seconde, l'Institut des langues secondes se réserve le droit d'exiger une évaluation additionnelle.",
        "extraDetails": [
            "Volet / Course Component: Cours magistral / Lecture",
            "L'Institut des langues secondes se réserve le droit d'exiger une évaluation additionnelle. / L'Institut des langues secondes se réserve le droit d'exiger une évaluation additionnelle."
        ],
        "language": "Bilingual/Unofficial/Unspecified",
        "title": "Test de compétence en français langue seconde / Test de compétence en français langue seconde",
        "year": 1
    },
    {
        "code": "FLS 1510",
        "credits": 3,
        "description": "Initiation au code linguistique de base (prononciation et orthographe, grammaire, vocabulaire). Présentation de quelques stratégies d'apprentissage de la langue seconde. Activités de compréhension et d'expression élémentaires à l'oral et à l'écrit à partir de documents simples dans un contexte universitaire.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Les auditeurs ne sont pas admis."
        ],
        "language": "French",
        "title": "Oral and Written Communication in French as a Second Language: Beginner Level",
        "year": 1
    },
    {
        "code": "FLS 1511",
        "credits": 3,
        "description": "Développement  de la compréhension de l'oral et de l'écrit à partir de documents sélectionnés.  Techniques de production orale élémentaire; pratique d'échanges simples.  Initiation à la phrase écrite. Éléments pertinents du code linguistique. Pratique individuelle.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 1510 ou l'équivalent. Les auditeurs ne sont pas admis."
        ],
        "language": "French",
        "title": "Oral and Written Communication in French as a Second Language: Elementary Level I",
        "year": 1
    },
    {
        "code": "FLS 1512",
        "credits": 3,
        "description": "Développement de la compréhension de l'oral et de l'écrit ; identification des idées principales. Développement des techniques de production orale; pratique permettant des conversations simples. Développement de l'expression écrite simple. Éléments pertinents du code linguistique. Pratique individuelle.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 1511. Les cours FLS 1512, FLS 1611 ne peuvent être combinés pour l'obtention de crédits. Les auditeurs ne sont pas admis."
        ],
        "language": "French",
        "title": "Oral and Written Communication in French as a Second Language; Elementary Level II",
        "year": 1
    },
    {
        "code": "FLS 1513",
        "credits": 3,
        "description": "Introduction aux principes fondamentaux de la grammaire française : système de conjugaison, adjectifs et pronoms. Articulation de la phrase.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 1512. Les auditeurs ne sont pas admis."
        ],
        "language": "French",
        "title": "French Grammar for Second Language Learners: Elementary Level",
        "year": 1
    },
    {
        "code": "FLS 1611",
        "credits": 6,
        "description": "This course is an accelerated version of FLS 1511 and FLS 1512 to allow the completion of these two courses in one session. See these two course descriptions for content.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Les cours FLS 1611, FLS 1511, FLS 1512 ne peuvent être combinés pour l'obtention de crédits. Les auditeurs ne sont pas admis."
        ],
        "language": "French",
        "title": "Oral and Written Communication in French as a Second Language: Elementary Levels I and II",
        "year": 1
    },
    {
        "code": "FLS 1651",
        "credits": 6,
        "description": "",
        "extraDetails": [
            "Volet : Cours magistral",
            "Reserved for bursary students."
        ],
        "language": "French",
        "title": "Oral and Written French",
        "year": 1
    },
    {
        "code": "FLS 2500",
        "credits": 3,
        "description": "Développement de stratégies favorisant un apprentissage efficace et autonome en langue seconde. Découverte et optimisation de l'utilisation des ressources à la disposition des apprenants. Planification d'un portfolio de majeure en FLS.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 2512 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Apprendre à apprendre",
        "year": 2
    },
    {
        "code": "FLS 2511",
        "credits": 3,
        "description": "Révision et élargissement des stratégies de compréhension de l'oral et de l'écrit.  Pratique de l'expression orale : conversations libres, courts exposés. Pratique de l'expression écrite : la phrase simple, le paragraphe. Systématisation des connaissances du code linguistique. Pratique individuelle.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 1513  ou l'équivalent. Les auditeurs ne sont pas admis."
        ],
        "language": "French",
        "title": "Communication orale et écrite en français langue seconde : niveau intermédiaire I",
        "year": 2
    },
    {
        "code": "FLS 2512",
        "credits": 3,
        "description": "Compréhension de documents écrits et sonores d'intérêt général et universitaire.  Pratique de l'expression orale : discussions libres, courts exposés et exercices oraux. Pratique de l'expression écrite : la phrase simple et complexe, le paragraphe, le court texte. Systématisation des connaissances du code linguistique. Pratique individuelle.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable: FLS 2511 ou l'équivalent. Ces crédits excluent ceux de FLS 2611. Les auditeurs ne sont pas admis.Co- requisite: FLS 2512 or equivalent. Auditors are not permitted."
        ],
        "language": "French",
        "title": "Oral and Written Communication in French as a  Second Language: Intermediate Level II",
        "year": 2
    },
    {
        "code": "FLS 2513",
        "credits": 3,
        "description": "The sentence and its components: principal and subordinate.The verb conjugation system. Prepositions and principal conjunctions. Paragraph formation.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Concomitant : FLS 2512. Les auditeurs ne sont pas admis."
        ],
        "language": "French",
        "title": "Grammaire française pour étudiants en langue seconde : niveau intermédiaire",
        "year": 2
    },
    {
        "code": "FLS 2521",
        "credits": 3,
        "description": "Exploitation de textes pour la compréhension de l'écrit. Observation de modèles et réinvestissement dans des tâches d'écriture contextualisées : prise de notes, rédaction de messages, lettres, résumés, courts récits. Renforcement des connaissances grammaticales et lexicales.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 2513 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Lire et écrire en français langue seconde",
        "year": 2
    },
    {
        "code": "FLS 2522",
        "credits": 3,
        "description": "Exploitation de textes pour la compréhension de l'oral et introduction à l'évaluation critique du contenu; écoute dirigée de documents de longueur et de difficulté variées; prise de notes. Pratique de l'expression orale : imitation de modèles complexes, discussions structurées, commentaires, exposés. Renforcement des connaissances grammaticales et lexicales.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 2513 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Écouter et parler en français langue seconde",
        "year": 2
    },
    {
        "code": "FLS 2581",
        "credits": 3,
        "description": "Cours de français associé à un cours de 3 crédits dans une discipline donnée, suivi en français par des étudiants non francophones. L'objectif est de développer les capacités de compréhension en langue seconde (écoute et lecture) et d'aider l'étudiant à bien assimiler la matière de la discipline. Les réponses aux questions d'examen peuvent être fournies en anglais ou en français dans le cours de la discipline, en français seulement dans le cours de langue.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 2521 ou FLS 2522 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Immersion 1 : Compréhension orale et écrite",
        "year": 2
    },
    {
        "code": "FLS 2611",
        "credits": 6,
        "description": "Ce cours est une version accélérée des cours FLS 2511 et FLS 2512. Il permet de couvrir le contenu de ces deux cours en un trimestre. Voir la description de ces deux cours pour le contenu.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 1512 ou FLS 1611. Les cours FLS 2611, FLS 2511, FLS 2512 ne peuvent être combinés pour l'obtention de crédits. Les auditeurs ne sont pas admis."
        ],
        "language": "French",
        "title": "Communication orale et écrite en français langue seconde : Niveaux intermédiaires I et II",
        "year": 2
    },
    {
        "code": "FLS 2651",
        "credits": 6,
        "description": "",
        "extraDetails": [
            "Volet : Cours magistral",
            "Reserved for bursary students."
        ],
        "language": "French",
        "title": "Oral and Written French",
        "year": 2
    },
    {
        "code": "FLS 2731",
        "credits": 3,
        "description": "Pratique intensive de la compréhension de l'oral et sensibilisation aux niveaux de langue. Étude de documents sonores d'envergure. Travaux de laboratoire.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 2522 ou l'équivalent. Les auditeurs ne sont pas admis."
        ],
        "language": "French",
        "title": "Compréhension de l'oral en français langue seconde : niveau avancé I",
        "year": 2
    },
    {
        "code": "FLS 2741",
        "credits": 3,
        "description": "Pratique systématique de la compréhension de l'écrit. Lecture de textes de genre et difficultés variés. Introduction à la lecture critique et sensibilisation aux niveaux de langue.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 2521 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Mieux lire en FLS",
        "year": 2
    },
    {
        "code": "FLS 2751",
        "credits": 3,
        "description": "Étude et pratique de la communication orale dans des situations de communication impliquant les registres de la langue familière et semi-formelle. Expression des opinions et des sentiments. Observation et imitation de modèles variés. Conversations dirigées (spontanées et préparées) et discussions. Exercices en classe et au laboratoire.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 2522 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Discutons-en",
        "year": 2
    },
    {
        "code": "FLS 2761",
        "credits": 3,
        "description": "Étude des étapes nécessaires à l'élaboration de divers genres d'écrits : rédaction de récits, résumés et analyses de modèles de registres variés. Éléments de correspondance  courante. Organisation structurée des paragraphes avec consolidation des notions d'autocorrection.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2521 ou l'équivalent, FLS 2771 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Mieux écrire en FLS",
        "year": 2
    },
    {
        "code": "FLS 2771",
        "credits": 3,
        "description": "Étude systématique de notions grammaticales par le biais d'activités actionnelles et de réalisation de tâches   à oral et à l'écrit. Types et formes de phrases simples et complexes. Consolidation de l'emploi des catégories grammaticales,  analyse syntaxique et étude de la conjugaison.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2521, FLS 2522 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Grammaire en contexte : interactions orales et écrites",
        "year": 2
    },
    {
        "code": "FLS 2772",
        "credits": 3,
        "description": "Perfectionnement de la prononciation en français standard; caractéristiques articulatoires et prosodiques. Correspondances lettres/sons. Sensibilisation aux registres de la communication.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 2513 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Mieux prononcer pour mieux communiquer en FLS",
        "year": 2
    },
    {
        "code": "FLS 2791",
        "credits": 3,
        "description": "Engagement et travail bénévole dans un contexte francophone choisi, approuvé et encadré par le professeur du cours en partenariat avec le Centre d'engagement mondial et communautaire.  Encadrement en classe et évaluation mesurée par des activités de réflexion critique à l'oral et à l'écrit.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2521, FLS 2522 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "De la salle de classe à la communauté : apprentissage du FLS par le bénévolat",
        "year": 2
    },
    {
        "code": "FLS 3500",
        "credits": 3,
        "description": "Exercices diagnostiques et élaboration de stratégies pour améliorer la compréhension de l'oral et de l'écrit et la production orale et écrite aux niveaux intermédiaire-fort et avancé.  Une attestation de compétence faisant état du profil langagier de l'étudiant est délivré à la suite d'une série de tests passés avec succès.",
        "extraDetails": [
            "Volet : Cours magistral"
        ],
        "language": "French",
        "title": "Compétence en langue seconde : Exercices et évaluation",
        "year": 3
    },
    {
        "code": "FLS 3581",
        "credits": 3,
        "description": "Cours de français associé à un cours de 3 crédits dans une discipline donnée, suivi en français par des étudiants non francophones. L'objectif est de développer les capacités de production orale et écrite en langue seconde et, ainsi, de donner aux étudiants la confiance nécessaire pour exprimer des idées et rédiger des travaux en français.  Les réponses aux questions d'examen peuvent être fournies en anglais ou en français dans le cours de la discipline, en français seulement dans le cours de langue.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2581, FLS 2751 ou FLS 2581, FLS 2761 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Immersion 2 : Production orale et écrite",
        "year": 3
    },
    {
        "code": "FLS 3751",
        "credits": 3,
        "description": "Étude et pratique systématique de diverses formes de communication orale utilisées dans le cadre de situations semi-formelles propres à la vie universitaire (comptes rendus, exposés, tables rondes). Étude et application des techniques employées par le locuteur et par l'interlocuteur. Observation et imitation de modèles variés. Raffinement de la prononciation, du vocabulaire et de la grammaire de l' oral.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 2751 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "FLS et l'art de s'exprimer",
        "year": 3
    },
    {
        "code": "FLS 3761",
        "credits": 3,
        "description": "Application et perfectionnement individuel des techniques et procédés d'écriture selon la spécificité du  genre discursif par le biais de tâches d'écriture.  Raffinement du code orthographique et syntaxique; enrichissement du vocabulaire expressif et spécialisé. Stratégies avancées d'autonomie en écriture.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2761 ou l'équivalent, FLS 2771 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "S'exprimer à l'écrit en FLS en contexte universitaire",
        "year": 3
    },
    {
        "code": "FLS 3771",
        "credits": 3,
        "description": "Étude systématique et application des notions grammaticales dans le cadre de la phrase complexe et du paragraphe (juxtaposition, coordination, subordination) ; emploi des modes et concordance des temps; emploi des connecteurs logiques à l'oral et à l'écrit (explication, comparaison, condition, cause, conséquence, but, opposition et concession, etc.). Le groupe nominal : étude raisonnée du genre grammatical (marques et attribution). Exercices correctifs, interactifs et productifs. Activités et tâches communicatives.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 2771 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "La grammaire des textes universitaires en FLS",
        "year": 3
    },
    {
        "code": "FLS 3773",
        "credits": 3,
        "description": "Étude exploratoire du vocabulaire : origines,  formation et rapports des mots entre eux. Analyse  de règles d'emploi à l'oral et à l'écrit. Analyse et création de champs sémantiques et lexicaux grâce à des tâches exploratoires. Activités à partir d'échantillons langagiers authentiques. Exploitation de ressources lexicales.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2521, FLS 2522 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Le mot juste en FLS",
        "year": 3
    },
    {
        "code": "FLS 3791",
        "credits": 3,
        "description": "Analyse de la langue et des conventions utilisées sur internet et dans les médias sociaux francophones. Développement et approfondissement de compétences en littératie numérique pour l'apprentissage du FLS. Pratique de la communication orale et écrite médiatisée par les technologies: blogues, wikis, forums de discussion, fils Twitter et plus.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2761 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Technologies, internet et médias sociaux en FLS",
        "year": 3
    },
    {
        "code": "FLS 4500",
        "credits": 3,
        "description": "Cours synthèse. Projets constituant à la fois une synthèse des connaissances et une réflexion sur le parcours d'apprentissage. Formulation d'objectifs d'apprentissage pour l'avenir. Réalisation et présentation d'un portfolio illustrant le développement linguistique et les réussites majeures.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : 18 crédits de cours en Français langue seconde (FLS). Cours réservé aux étudiants de la Majeure Français langue seconde."
        ],
        "language": "French",
        "title": "Séminaire de fin de parcours",
        "year": 4
    },
    {
        "code": "FLS 4581",
        "credits": 3,
        "description": "Cours de français associé à un cours de 3 crédits de niveau 3000 ou 4000 (autre que celui associé à FLS 4781) d'une discipline différente suivi concurremment en français par des étudiants non francophones. L'objectif est d'aider les étudiants à faire des présentations orales et à participer à des débats et tables rondes en rapport avec la discipline étudiée en L2. L'accent est mis sur la justesse et la correction des formes linguistiques employées et sur l'analyse d'une sélection de modèles de communication orale reliés au milieu universitaire et aux thèmes spécifiques du cours de discipline. Tout travail remis dans le cours de langue ne pourra être soumis pour notation dans le cours de discipline.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2751, FLS 3581 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Immersion autonome : Communication et argumentation à l'oral en contexte universitaire",
        "year": 4
    },
    {
        "code": "FLS 4774",
        "credits": 3,
        "description": "Développement de la compréhension de la langue parlée au Canada français dans ses variantes principales. Étude de documents écrits et sonores.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2751, FLS 2761 ou l'équivalent. Les auditeurs ne sont pas admis."
        ],
        "language": "French",
        "title": "Le français d'ici",
        "year": 4
    },
    {
        "code": "FLS 4775",
        "credits": 3,
        "description": "Examen de l'apport de la compréhension culturelle à la qualité de la communication en langue seconde, à partir de documents de diverses sources. Étude comparée des réactions des francophones et des anglophones à des situations communes; identification des composantes culturelles qui expliquent ces réactions, applications",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2751, FLS 2761 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Dimensions et compétences culturelles en FLS. Bilingue et francophile pour la vie",
        "year": 4
    },
    {
        "code": "FLS 4776",
        "credits": 3,
        "description": "Évoluez avec aisance dans le contexte particulier de la profession que vous exercez ou dans votre emploi de rêve. À l'oral et à l'écrit. reconnaissez et utilisez les formules les plus directes et efficaces pour enrichir votre communication.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 3761 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Le français langue seconde et le monde de travail",
        "year": 4
    },
    {
        "code": "FLS 4781",
        "credits": 3,
        "description": "Cours de français associé à un cours de 3 crédits de niveau 3000 ou 4000 (autre que celui associé à FLS 4581) d'une discipline différente suivi concurremment en français par des étudiants non francophones. L'objectif est d'aider les étudiants à rédiger des rapports de recherche et des articles scientifiques en rapport avec la discipline étudiée en L2. L'accent est mis sur la justesse et la correction des des formes linguistiques employées et sur l'analyse d'une sélection de modèles de composition reliés au milieu universitaire et aux thèmes spécifiques du cours. Tout devoir remis dans le cours de langue ne pourra être soumis pour notation dans le cours de discipline.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalables : FLS 2761, FLS 3581 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Immersion autonome : Perfectionnement de l'écrit en contexte universitaire",
        "year": 4
    },
    {
        "code": "FLS 4791",
        "credits": 3,
        "description": "S'exprimer avec nuance,  précision et fluidité dans des situations de communication variées à l'écrit et à l'oral  par le biais de documents déclencheurs audios, vidéos et écrits ayant trait aux domaines des arts, du sport et des loisirs. Étude du vocabulaire des domaines cibles, de connecteurs logiques,  de structures syntaxiques complexes. Stratégies de communication.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 3761 ou FLS 3581 ou l'équivalent. Les auditeurs ne sont pas admis. Consulter le Département pour plus de détails."
        ],
        "language": "French",
        "title": "Interagir en FLS avec le monde qui nous entoure : actualité, loisirs et culture",
        "year": 4
    },
    {
        "code": "FLS 0505",
        "credits": 0,
        "description": "Éléments fondamentaux de la compréhension orale et de l'écrit permettant d'identifier le sujet, les idées principales et les détails dans des passages courts et simplifiés. Pour l'expression orale et écrite, activités de conversation simples et discussions brèves, phrases simples et complexes, survol du paragraphe.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : Connaissance fondamentale de français et pointage satisfaisant au test de classement."
        ],
        "language": "French",
        "title": "Fondements préuniversitaires en français langue seconde",
        "year": 0
    },
    {
        "code": "FLS 0510",
        "credits": 0,
        "description": "Développement de la compréhension orale et de l'écrit: introduction à l'inférence et aux modèles d'organisation dans des passages de plus en plus authentiques. Révision des habiletés en expressions orale et écrite, activités telles que : dialogues et jeux de rôle, construction de phrases complexes, composition de paragraphes courts.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 0505 ou pointage équivalant au test de classement."
        ],
        "language": "French",
        "title": "Accès préuniversitaire en français langue seconde",
        "year": 0
    },
    {
        "code": "FLS 0520",
        "credits": 0,
        "description": "Poursuite des acquis en compréhension orale et de l'écrit : compréhension de passages plus longs avec une syntaxe variable. En expression orale et écrite, initiation aux exigences universitaires comme : présentations orales, paragraphes complexes et format de la dissertation.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 0510 ou pointage équivalant au test de classement."
        ],
        "language": "French",
        "title": "Perfectionnement préuniversitaire en français langue seconde",
        "year": 0
    },
    {
        "code": "FLS 0530",
        "credits": 0,
        "description": "Raffinement des habiletés de compréhension orale et de l'écrit déjà maîtrisées et amélioration de la pensée critique. En expression orale et écrite, apprentissage de stratégies d'autocorrection à l'aide de travaux tels que : débats et présentations orales longues, résumés non guidés et dissertations selon divers formats d'organisation.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 0520 ou pointage équivalant au test de classement."
        ],
        "language": "French",
        "title": "Enrichissement péuniversitaire en français langue seconde",
        "year": 0
    },
    {
        "code": "FLS 0540",
        "credits": 0,
        "description": "Brochette de passages étendus authentiques pour l'amélioration de la compréhension orale et de l'écrit avec emphase sur l'écoute et la lecture critiques. En expression orale et écrite, insistance sur : production orale fluide et correcte dans une variété de situations telles qu'entrevues et discours, organisation et synthèse de l'information provenant de différentes sources et expansion de la rédaction formelle pour inclure des rapports de recherche et des dissertations formelles suivant divers patrons.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : FLS 0530 ou pointage équivalant au test de classement."
        ],
        "language": "French",
        "title": "Passerelle universitaire en français langue seconde",
        "year": 0
    },
    {
        "code": "FLS 0550",
        "credits": 0,
        "description": "Atelier sur un thème choisi portant sur les habiletés réceptives ou productives, des objectifs lexicaux, la grammaire, etc. Le thème peut varier d'une section à l'autre.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : Permission du département."
        ],
        "language": "French",
        "title": "Français sur objectifs universitaires : Habiletés complémentaires",
        "year": 0
    },
    {
        "code": "FLS 0560",
        "credits": 0,
        "description": "Le thème peut varier d'une section à l'autre.",
        "extraDetails": [
            "Volet : Cours magistral",
            "Préalable : Permission du département."
        ],
        "language": "French",
        "title": "Formation sur mesure en français langue seconde",
        "year": 0
    }
]
