[
    {
        "code": "PHI1101",
        "description": "Development of fundamental skills in reasoning and critical thinking through the study of argument types, logical structures, criteria used in the evaluation of arguments, and forms of fallacious reasoning.",
        "language": "English",
        "restriction": "Students who complete PHI 1301 are exempted from the requirement of completing PHI 1101.",
        "title": "Reasoning and Critical Thinking",
        "year": "1"
    },
    {
        "code": "PHI1102",
        "description": "Development of fundamental skills in moral reasoning through the study of ethical issues and the criteria used in justifying or evaluating actions.",
        "language": "English",
        "restriction": "Prerequisite: PHI1101 or PHI1301. Students who complete PHI1302 are exempted from the requirement of completing one of PHI 1102, PHI 1103 or PHI1104.",
        "title": "Moral Reasoning",
        "year": "1"
    },
    {
        "code": "PHI1103",
        "description": "A critical examination of fundamental philosophical problems such as the mind and body distinction, the possibility of knowledge of the external world, freedom and determinism, the definition of the concept of truth and the meaning of life.",
        "language": "English",
        "restriction": "Prerequisite: PHI1101 or PHI1301. Students who complete PHI1302 are exempted from the requirement of completing one of PHI 1102, PHI 1103 or PHI1104.",
        "title": "Fundamental Philosophical Questions",
        "year": "1"
    },
    {
        "code": "PHI1104",
        "description": "An historical introduction to philosophy through the study of writings of major Western philosophers such as Plato, Aristotle, Aquinas, Descartes, Hume, Kant, Hegel, Nietzsche, Wittgenstein, Sartre. (HP)",
        "language": "English",
        "restriction": "Prerequisite: PHI1101 or PHI1301. Students who complete PHI1302 are exempted from the requirement of completing one of PHI 1102, PHI 1103 or PHI1104.",
        "title": "Great Philosophers",
        "year": "1"
    },
    {
        "code": "PHI1301",
        "description": "An introduction to philosophy and its methods through the study of arguments concerning enduring questions in philosophy. A writing intensive course.",
        "language": "English",
        "restriction": "Strongly recommended for students enrolled in Philosophy and Ethics programs, and for those considering further work in the subject. Students who complete PHI 1301 are exempted from the requirement of completing PHI 1101.",
        "title": "Philosophy: Ideas and Arguments",
        "year": "1"
    },
    {
        "code": "PHI1302",
        "description": "More advanced study of methods of philosophical thinking through in-depth analysis of texts dealing with enduring questions in philosophy. A writing intensive course.",
        "language": "English",
        "restriction": "Prerequisite: PHI 1301 or PHI 1101. Strongly recommended for students enrolled in Philosophy or Ethics programs, and for those considering further work in the subject. Students who complete PHI1302 are exempted from the requirement of completing one of PHI 1102, PHI 1103 or PHI1104.",
        "title": "Philosophy: Themes and Texts",
        "year": "1"
    },
    {
        "code": "PHI1370",
        "description": "Basic philosophical questions and theories about the nature of human beings and the meaning of life. Special emphasis on how such questions arise in the context of the health-care professions. Readings from classical and contemporary sources.",
        "language": "English",
        "restriction": "Reserved for students of the Faculty of Health Sciences.",
        "title": "Philosophical Issues in Health Care",
        "year": "1"
    },
    {
        "code": "PHI1501",
        "description": "Acquisition de compétences fondamentales en raisonnement et analyse critique des argumentations par l'étude des types d'argumentation, des structures logiques, des critères employés dans l'évaluation des arguments et des sophismes.",
        "language": "French",
        "restriction": "Les étudiants ayant complété avec succès PHI 1701 sont exemptés de l'exigence de compléter PHI 1501.",
        "title": "Raisonnement et pensée critique",
        "year": "1"
    },
    {
        "code": "PHI1502",
        "description": "Acquisition de compétences fondamentales en raisonnement moral par l'étude de questions éthiques et de critères par lesquels on juge ou justifie les actions.",
        "language": "French",
        "restriction": "Préalable : PHI1501 ou PHI1701. Les étudiants ayant complété avec succès PHI 1702 sont exemptés de l'exigence de compléter l'un des cours PHI 1502, PHI 1503 ou PHI 1504.",
        "title": "Raisonnement moral",
        "year": "1"
    },
    {
        "code": "PHI1503",
        "description": "Examen critique de problèmes philosophiques fondamentaux tels que la distinction entre corps et esprit, la possibilité d'une connaissance du monde extérieur, la question du déterminisme et du libre arbitre, la définition du concept de vérité et la question du sens de la vie.",
        "language": "French",
        "restriction": "Préalable : PHI1501 ou PHI1701. Les étudiants ayant complété avec succès PHI 1702 sont exemptés de l'exigence de compléter l'un des cours PHI 1502, PHI 1503 ou PHI 1504.",
        "title": "Les grandes questions philosophiques",
        "year": "1"
    },
    {
        "code": "PHI1504",
        "description": "Introduction historique à la philosophie par l'étude des oeuvres de grands philosophes occidentaux tels que Platon, Aristote, Thomas d'Aquin, Descartes, Hume, Kant, Hegel, Nietzsche, Wittgenstein, Sarte. (HP)",
        "language": "French",
        "restriction": "Préalable : PHI1501 ou PHI1701. Les étudiants ayant complété avec succès PHI 1702 sont exemptés de l'exigence de compléter l'un des cours PHI 1502, PHI 1503 ou PHI 1504.",
        "title": "Les grands philosophes",
        "year": "1"
    },
    {
        "code": "PHI1701",
        "description": "Introduction à la philosophie et ses méthodes à travers l'étude d'arguments abordant de grandes questions philosophiques. Cours à haute intensité d'écriture.",
        "language": "French",
        "restriction": "Ce cours est fortement recommandé pour les étudiants inscrits dans un programme de philosophie ou d'éthique et pour ceux qui envisagent suivre d'autres cours dans ces disciplines. Les étudiants ayant complété avec succès PHI 1701 sont exemptés de l'exigence de compléter PHI 1501.",
        "title": "Philosophie : idées et arguments",
        "year": "1"
    },
    {
        "code": "PHI1702",
        "description": "Étude plus avancée des méthodes de travail en philosophie par l'analyse approfondie de textes abordant de grandes questions philosophiques. Cours à haute intensité d'écriture.",
        "language": "French",
        "restriction": "Préalable : PHI 1701 ou PHI 1501. Ce cours est fortement recommandé pour les étudiants inscrits dans un programme de philosophie ou d'éthique et pour ceux qui envisagent suivre d'autres cours dans ces disciplines. Les étudiants ayant complété avec succès PHI 1702 sont exemptés de l'exigence de compléter l'un des cours PHI 1502, PHI 1503 ou PHI 1504.",
        "title": "Philosophie : thèmes et textes",
        "year": "1"
    },
    {
        "code": "PHI1770",
        "description": "Questions philosophiques fondamentales relatives à la nature humaine et au sens de la vie. L'accent est mis sur la façon dont les professions de la santé sont confrontées à ces questions. Étude de textes classiques et contemporains.",
        "language": "French",
        "restriction": "Réservé aux étudiants et étudiantes de la Faculté des sciences de la santé.",
        "title": "Problèmes philosophiques liés aux soins de santé",
        "year": "1"
    },
    {
        "code": "PHI2122",
        "description": "Philosophy in Antiquity: an art of living, an ideal of life and knowledge and a search for the meaning of life. A study of the main currents of Greek wisdom from Socrates to Marcus Aurelius : cynicism, scepticism, epicureanism and stoicism.",
        "language": "English",
        "restriction": "Previously PHI2312. Also offered as CLA2122. (HP).",
        "title": "Greek Wisdom",
        "year": "2"
    },
    {
        "code": "PHI2170",
        "description": "Provides foundations for formal treatment of argumentation and validity. Topics include formalized languages, interpretation, translation, sentential calculus and quantification theory.",
        "language": "English",
        "restriction": "",
        "title": "Logic I",
        "year": "2"
    },
    {
        "code": "PHI2172",
        "description": "Study of the main answers to the mind-body problem and or related questions such as: How to determine that other beings have thoughts? Can machines think? What is consciousness?",
        "language": "English",
        "restriction": "(ME).",
        "title": "Philosophy of Mind",
        "year": "2"
    },
    {
        "code": "PHI2174",
        "description": "Study of the major traditions in moral philosophy. Are there grounds for distinguishing between right and wrong? What is the relation between morality and custom, law and personal fulfilment?",
        "language": "English",
        "restriction": "",
        "title": "Ethics",
        "year": "2"
    },
    {
        "code": "PHI2183",
        "description": "Study of the major traditions in social and political philosophy. The roots of modern theories. Readings from writers such as Plato, Aristotle, Machiavelli, Hobbes, Locke, Rousseau, Kant.",
        "language": "English",
        "restriction": "",
        "title": "Political Philosophy",
        "year": "2"
    },
    {
        "code": "PHI2197",
        "description": "History as a type of knowledge and inquiry. Special reference to problems of explanation, objectivity, and causal analysis.",
        "language": "English",
        "restriction": "Also offered as HIS2197. (ME).",
        "title": "Philosophy of History",
        "year": "2"
    },
    {
        "code": "PHI2380",
        "description": "The birth of philosophy in Ancient Greece and its development, from the 6th to the 4th century B.C. Introduction to the originality and specificity of philosophical discourse through the study of Heraclitus, Parmenides, Empedocles, Anaxagoras, Democritus, Socrates, Plato and Aristotle.",
        "language": "English",
        "restriction": "Also offered as CLA2380. (HP).",
        "title": "Greek Philosophy or the Birth of Philosophy",
        "year": "2"
    },
    {
        "code": "PHI2381",
        "description": "Introduction to the systems of thought of the important figures of Arabic and Muslim philosophy, such as Kindi, Farabi, Ghazali, Ibn Tufayl, Averroes and Avicenna.",
        "language": "English",
        "restriction": "",
        "title": "Arab Philosophy",
        "year": "2"
    },
    {
        "code": "PHI2382",
        "description": "Introduction to major thinkers of the fifth to fourteenth centuries (Augustine to Ockham) and to some of the great questions of the era, concerning such matters as the nature of universals, of knowledge, and of the mind. Particular attention is paid to developments in epistemology and metaphysics.",
        "language": "English",
        "restriction": "(HP).",
        "title": "Philosophy in the Middle Ages",
        "year": "2"
    },
    {
        "code": "PHI2383",
        "description": "Introduction to major philosophers, from Descartes to Kant, and philosophical systems (Rationalism, Empiricism) of the 17th and 18th centuries, with emphasis on developments in epistemology and metaphysics.",
        "language": "English",
        "restriction": "(HP).",
        "title": "Modern Philosophy",
        "year": "2"
    },
    {
        "code": "PHI2386",
        "description": "Study of a philosophical tradition which has shaped contemporary thought. Existentialism questions the idea of human nature and emphasizes subjectivity, consciousness, freedom, finitude and the meaning of human existence. Readings from philosophers such as Kierkegaard, Heidegger, Jaspers, Sartre, Camus and Merleau-Ponty.",
        "language": "English",
        "restriction": "(HP).",
        "title": "Existentialism",
        "year": "2"
    },
    {
        "code": "PHI2389",
        "description": "Study of some of the basic principles and themes of Asian philosophical tradition such as Hinduism, Buddhism, Confucianism and Taoism. This course has variable topics and may be taken several times if the themes are diffrent.",
        "language": "English",
        "restriction": "(HP).",
        "title": "Asian Philosophy",
        "year": "2"
    },
    {
        "code": "PHI2390",
        "description": "Critical examination of some questions raised by women's studies. Topics will vary from year to year and may include moral issues such as abortion and equality, problems of ideology in psychology and art, or feminism as a political theory.",
        "language": "English",
        "restriction": "(EP).",
        "title": "Philosophical Issues in Women's Studies",
        "year": "2"
    },
    {
        "code": "PHI2391",
        "description": "Study of the rationality and objectivity of science through an analysis of the structure and function of scientific theories and of the development of scientific knowledge.",
        "language": "English",
        "restriction": "Previously PHI3394.",
        "title": "Philosophy of Science",
        "year": "2"
    },
    {
        "code": "PHI2392",
        "description": "Study of questions of esthetics such as: What is an esthetic property? Can one speak of esthetic knowledge through emotions? Is there an esthetic attitude? Study of philosophical questions relative to works of art, their production and their value.",
        "language": "English",
        "restriction": "(EP).",
        "title": "Esthetics and Philosophy of Art",
        "year": "2"
    },
    {
        "code": "PHI2393",
        "description": "Culture considered as the sum of all aspects of human activities that are socially transmitted. The Romantic reaction (Herder) to Enlightenment, the rejection of universal criteria and the cultural relativity of values.",
        "language": "English",
        "restriction": "(EP).",
        "title": "Philosophy of Culture",
        "year": "2"
    },
    {
        "code": "PHI2394",
        "description": "The nature of scientific thought and the relationships between science and culture, religion, politics, technology and society at large.",
        "language": "English",
        "restriction": "(EP).",
        "title": "Scientific Thought and Social Values",
        "year": "2"
    },
    {
        "code": "PHI2396",
        "description": "Study of moral issues in medical research and health care. Possible topics include human and animal experimentation; the rights and duties of health professionals and patients; euthanasia, abortion, reproductive technologies, genetic screening; funding and allocation decisions. Role of moral theories and concepts in addressing these problems.",
        "language": "English",
        "restriction": "(EP).",
        "title": "Bioethics",
        "year": "2"
    },
    {
        "code": "PHI2397",
        "description": "Within the context of the diminishing role of the state and of globalization, study of ethical issues in business such as: The social responsibility of firms, the rights and obligations of employees and employers, the problem of discrimination.",
        "language": "English",
        "restriction": "(EP).",
        "title": "Business Ethics",
        "year": "2"
    },
    {
        "code": "PHI2398",
        "description": "Study of ethical questions concerning the preservation of species and natural objects, animal rights, and our obligations towards future generations. Study of theoretical frameworks such as deep ecology (Naess) and of environmental ethics (Carlson).",
        "language": "English",
        "restriction": "(EP).",
        "title": "Environmental Ethics",
        "year": "2"
    },
    {
        "code": "PHI2522",
        "description": "La philosophie dans l'Antiquité : un art de vivre, un idéal de vie et de connaissance et la recherche du sens de la vie. Étude des principaux courants de la sagesse grecque de Socrate à Marc-Aurèle : cynisme, scepticisme, épicurisme et stoïcisme.",
        "language": "French",
        "restriction": "Antérieurement PHI2712. Aussi offert sous la cote CLA2522. (HP).",
        "title": "La sagesse grecque",
        "year": "2"
    },
    {
        "code": "PHI2570",
        "description": "Initiation au traitement formel des raisonnements et de la validité. Langages formalisés, interprétations, traduction, calcul des propositions et théorie des quantificateurs.",
        "language": "French",
        "restriction": "",
        "title": "Logique I",
        "year": "2"
    },
    {
        "code": "PHI2572",
        "description": "Étude des principales solutions au problème de la relation corps-esprit et de questions connexes telles que : comment détermine-t-on que d'autres êtres ont des pensées? Est-ce qu'une machine pourrait penser? Qu'est-ce que la conscience?",
        "language": "French",
        "restriction": "(ME).",
        "title": "Philosophie de l'esprit",
        "year": "2"
    },
    {
        "code": "PHI2574",
        "description": "Étude des grands courants de la philosophie morale. Le rapport entre la morale, la loi et les moeurs.",
        "language": "French",
        "restriction": "",
        "title": "Éthique",
        "year": "2"
    },
    {
        "code": "PHI2583",
        "description": "Étude des grands courants de la philosophie sociale et politique. Origines de théories contemporaines. Étude des principaux auteurs tels que Platon, Aristote, Machiavel, Hobbes, Locke, Rousseau, Kant.",
        "language": "French",
        "restriction": "",
        "title": "Philosophie politique",
        "year": "2"
    },
    {
        "code": "PHI2597",
        "description": "L'histoire comme discipline; son épistémologie spécifique. Étude, en particulier, de problèmes tels que l'explication historique, l'objectivité et l'analyse causale.",
        "language": "French",
        "restriction": "Aussi offert sous la cote HIS2597. (ME).",
        "title": "Philosophie de l'histoire",
        "year": "2"
    },
    {
        "code": "PHI2780",
        "description": "La naissance de la philosophie dans la Grèce antique et son développement, du 6e siècle au 4e siècle avant notre ère. Introduction à l'originalité et à la spécificité du discours philosophique par l'étude de Héraclite, Parménide, Empédocle, Anaxagore, Démocrite, Socrate, Platon et Aristote.",
        "language": "French",
        "restriction": "Aussi offert sous la cote CLA2780. (HP).",
        "title": "La Philosophie grecque ou la naissance de la philosophie",
        "year": "2"
    },
    {
        "code": "PHI2781",
        "description": "Introduction aux systèmes de pensée des grands représentants de la philosophie arabo-musulmane, tels que Kindi, Farabi, Ghazali, Ibn Tufayl, Averroès et Avicenne.",
        "language": "French",
        "restriction": "",
        "title": "Philosophie arabe",
        "year": "2"
    },
    {
        "code": "PHI2782",
        "description": "Introduction aux grands auteurs, d'Augustin à Ockham, ainsi qu'aux grandes questions philosophiques (querelle des universaux, nature de la connaissance, nature de l'âme) du Ve au XIVe siècles, avec une attention toute particulière accordée aux développements en épistémologie et en métaphysique.",
        "language": "French",
        "restriction": "(HP).",
        "title": "La Philosophie au Moyen-Âge",
        "year": "2"
    },
    {
        "code": "PHI2783",
        "description": "Introduction aux grands auteurs, de Descartes à Kant, ainsi qu'aux grands systèmes philosophiques (rationalisme, empirisme) des 17e et 18e siècles et, en particulier, aux développements de l'épistémologie et de la métaphysique.",
        "language": "French",
        "restriction": "(HP).",
        "title": "Philosophie moderne",
        "year": "2"
    },
    {
        "code": "PHI2786",
        "description": "Étude d'un courant philosophique qui a marqué la pensée contemporaine. L'existentialisme remet en question le concept de la nature humaine et souligne l'importance de la subjectivité, de la conscience, de la liberté, de la finitude et du sens de l'existence. Étude de philosophes tels que Kierkegaard, Heidegger, Jaspers, Sartre, Camus et Merleau-Ponty.",
        "language": "French",
        "restriction": "(HP).",
        "title": "Existentialisme",
        "year": "2"
    },
    {
        "code": "PHI2789",
        "description": "Étude de certains des principes et thèmes des traditions philosophiques asiatiques telles que l'hindouisme, le bouddhisme, le confucianisme et le taoïsme. Ce cours à thèmes variables peut être suivi plusieurs fois pourvu que les thèmes diffèrent.",
        "language": "French",
        "restriction": "(HP).",
        "title": "Philosophie asiatique",
        "year": "2"
    },
    {
        "code": "PHI2790",
        "description": "Examen critique de questions soulevées par le féminisme. Les diverses approches, appelées à varier d'une année à l'autre, aux problèmes moraux comme l'avortement et l'égalité des droits, aux questions d'idéologie impliquées dans l'art et la psychologie, ou au féminisme en tant que théorie politique.",
        "language": "French",
        "restriction": "(EP).",
        "title": "Aspects philosophiques du féminisme",
        "year": "2"
    },
    {
        "code": "PHI2791",
        "description": "Étude de la rationalité et de l'objectivité scientifique par le biais d'une analyse de la structure et de la fonction des théories scientifiques et du mode d'accroissement des savoirs scientifiques.",
        "language": "French",
        "restriction": "Antérieurement PHI 3794.",
        "title": "Philosophie des sciences",
        "year": "2"
    },
    {
        "code": "PHI2792",
        "description": "Étude des questions d'esthétique telles que : qu'est-ce qu'une propriété esthétique? Peut-on parler d'une connaissance esthétique par les émotions? Existe-t-il une attitude esthétique? Étude des questions philosophiques liées à la nature des oeuvres d'art, à leur mode de production et à leur valeur.",
        "language": "French",
        "restriction": "(EP).",
        "title": "Esthétique et philosophie de l'art",
        "year": "2"
    },
    {
        "code": "PHI2793",
        "description": "La culture en tant qu'ensemble des aspects de l'activité humaine qui sont transmis socialement. La réaction romantique aux Lumières (Herder), le rejet des critères universels et la relativité culturelle des valeurs.",
        "language": "French",
        "restriction": "(EP).",
        "title": "Philosophie de la culture",
        "year": "2"
    },
    {
        "code": "PHI2794",
        "description": "L'univers du savoir et les problèmes qu'il soulève; nature des connaissances, classification des savoirs, rapports entre les différents modes de connaissance. Science et société, science et culture, science et avenir du monde.",
        "language": "French",
        "restriction": "(EP).",
        "title": "Pensée scientifique et valeurs sociales",
        "year": "2"
    },
    {
        "code": "PHI2796",
        "description": "Étude des problèmes éthiques propres à la recherche médicale et aux soins de santé : expérimentation humaine et animale; droits et devoirs des professionnels de la santé et des patients; euthanasie, avortement, techniques de reproduction assistée, dépistage génétique; priorités en matière de fonds et de subventions. Rôle des théories et des concepts éthiques dans la résolution de ces problèmes.",
        "language": "French",
        "restriction": "(EP).",
        "title": "Bioéthique",
        "year": "2"
    },
    {
        "code": "PHI2797",
        "description": "Dans le contexte de la diminution du rôle de l'État et de la mondialisation, étude des questions d'éthique dans le monde des affaires telles que la responsabilité sociale de l'entreprise, les droits et les obligations des employés et des employeurs et le problème de la discrimination.",
        "language": "French",
        "restriction": "(EP).",
        "title": "Éthique des affaires",
        "year": "2"
    },
    {
        "code": "PHI2798",
        "description": "Étude de questions éthiques sur la préservation des espèces et des objets naturels, sur les droits des animaux, sur l'obligation envers les générations futures. Examen de cadres théoriques tels que l'écologie profonde (Naess) et l'esthétique environnementale (Carlson).",
        "language": "French",
        "restriction": "(EP).",
        "title": "L'éthique environnementale",
        "year": "2"
    },
    {
        "code": "PHI3105",
        "description": "Phenomenology as the attempt to overcome the distinction between appearance and reality by going back to the things themselves and by developing a new descriptive method. Study of texts from the precursors, Husserl, and his legacy, from Heidegger to French phenomenology.",
        "language": "English",
        "restriction": "Prerequisite: 12 PHI credits including PHI2383. (ME).",
        "title": "Phenomenology",
        "year": "3"
    },
    {
        "code": "PHI3108",
        "description": "Readings from 17th and 18th century philosophers such as Descartes, Leibniz, Spinoza, Malebranche, Locke, Berkeley, Hume.",
        "language": "English",
        "restriction": "Prerequisites: 12 PHI credits including PHI2383. (HP). This course has variable topics and may be taken several times if the themes are different.",
        "title": "Texts in Modern Philosophy",
        "year": "3"
    },
    {
        "code": "PHI3125",
        "description": "An introduction to some of the philosophical questions raised by cognitive science, the interdisciplinary study of the mind which encompasses work done in computer science, linguistics, neuroscience, philosophy and psychology.",
        "language": "English",
        "restriction": "",
        "title": "Philosophy of Cognitive Science",
        "year": "3"
    },
    {
        "code": "PHI3164",
        "description": "Study of meta-ethical issues. The metaphysical and epistemological foundations of contemporary normative theory.",
        "language": "English",
        "restriction": "Prerequisites: 12 PHI credits including PHI2174. (EP). This course has variable topics and may be taken several times if the themes are different.",
        "title": "Contemporary Ethical Theories",
        "year": "3"
    },
    {
        "code": "PHI3170",
        "description": "Analysis of the concept of knowledge and of the distinctions between a priori and a posteriori and between analytic and synthetic knowledge. Study of the issues relative to the possibility of a knowledge of the external world and to the challenge of scepticism, and study of the debate between rationalism and empiricism.",
        "language": "English",
        "restriction": "Prerequisites: 15 PHI credits including PHI2170, PHI2383. (ME). This course has variable topics and may be taken several times if the themes are different.",
        "title": "Topics in Theory of Knowledge",
        "year": "3"
    },
    {
        "code": "PHI3171",
        "description": "Topics covered may include advanced quantification theory, axiomatic systems, set theory, metatheory of first-order logic with soundness and completeness theorems, model theory, G del's incompleteness theorems.",
        "language": "English",
        "restriction": "Prerequisites: PHI2170, six 1000-level PHI credits and three PHI credits at the 2000 level. Previously PHI2171. (ME).",
        "title": "Logic II",
        "year": "3"
    },
    {
        "code": "PHI3174",
        "description": "Study of questions relative to the structure of reality, to questions concerning the fundamental concepts of time, space, cause, identity and to the debate between realism and idealism.",
        "language": "English",
        "restriction": "Prerequisites: 15 PHI credits including PHI2170, PHI2383. This course has variable topics and may be taken several times if the themes are different.",
        "title": "Topics in Metaphysics",
        "year": "3"
    },
    {
        "code": "PHI3370",
        "description": "An introduction to the philosophy of Plato through the reading in their entirety of a selection of dialogues that represent the diversity of his styles, methods, and ideas.",
        "language": "English",
        "restriction": "Prerequisite: 12 PHI credits including PHI2380. Also offered as CLA3370. (HP).",
        "title": "Plato. The Philosopher as Poet, Lover, Dialectician and King",
        "year": "3"
    },
    {
        "code": "PHI3377",
        "description": "Survey of the major trends in 20th-century European philosophy: existentialism, phenomenology, hermeneutics, critical theory, structuralism, and poststructuralist.",
        "language": "English",
        "restriction": "Prerequisite: 15 PHI credits including PHI2383. (ME).",
        "title": "Contemporary Continental Philosophy",
        "year": "3"
    },
    {
        "code": "PHI3380",
        "description": "An introduction to the philosophy of Aristotle through a reading of selected texts representing his wide-ranging interests in psychology, logic, physics, metaphysics ethics, and politics.",
        "language": "English",
        "restriction": "Prerequisite: 12 PHI credits including PHI2380. Also offered as CLA3380. (HP).",
        "title": "Aristotle. The Pursuit of Wisdom for its Own Sake",
        "year": "3"
    },
    {
        "code": "PHI3382",
        "description": "Kant and the autonomy of human beings, that is to say the possibility of discovering the principles of knowledge and action with the help of reason alone. Introduction to his philosophy through the reading of the \"Critique of Pure Reason\", which sets out a theory of knowledge and a critique of metaphysics.",
        "language": "English",
        "restriction": "Prerequisite: 12 PHI credits including PHI2383. (HP).",
        "title": "Kant and critical philosophy",
        "year": "3"
    },
    {
        "code": "PHI3386",
        "description": "Study of key philosophers from the 19th century, such as Fichte, Schelling, Hegel, Schopenhauer, Darwin, Kierkegaard, Marx, Nietzsche and Mach.",
        "language": "English",
        "restriction": "Prerequisites: 12 PHI credits including PHI2383. (HP). This course has variable topics and may be taken several times if the themes are different.",
        "title": "Topics in 19th Century Philosophy",
        "year": "3"
    },
    {
        "code": "PHI3387",
        "description": "The catchword of Enlightenment: Think for oneself. Study of the topics that follow from it: the autonomy of reason, liberty of thought, tolerance, the critique of religion, naturalism, universalism. Readings from authors such as Locke, Hume, Burke, Smith, Montesquieu, Voltaire, Rousseau, Kant, Lessing.",
        "language": "English",
        "restriction": "Prerequisite: 12 PHI credits including PHI2383. (HP).",
        "title": "Philosophy of the Enlightenment",
        "year": "3"
    },
    {
        "code": "PHI3390",
        "description": "Extensions and alternatives to classical first-order logic, such as second-order logic, type theory, modal logic, many-valued, constructive or paraconsistent logics. Investigation of philosophical issues connected with logic such as theories of truth, logical consequence, conditionals and paradoxes.",
        "language": "English",
        "restriction": "Prerequisites: PHI2170, 6 PHI credits at the 1000-level and 3 PHI credits at the 2000 level. Previously PHI2171. (ME).",
        "title": "Philosophical Logic",
        "year": "3"
    },
    {
        "code": "PHI3391",
        "description": "Study of themes common to linguistics and philosophy. The formal approach to syntax and semantics and current approaches to pragmatics. Study of questions pertaining to the epistemology of linguistics and relative to the cognitive (language-thought) and ontological (language-world) aspects of language.",
        "language": "English",
        "restriction": "Prerequisite: 12 PHI credits including PHI2170. Also offered as LIN3371. (ME).",
        "title": "Philosophy of Language",
        "year": "3"
    },
    {
        "code": "PHI3393",
        "description": "Study of the various philosophical justifications and critiques of religious experience, of problems linked to the idea of a transcendent being and to the problem of evil. Study of authors such as Aquinas, Pascal, Kant, Hegel, Feuerbach, Kierkegaard, Nietzsche, Freud, James.",
        "language": "English",
        "restriction": "Prerequisite: 12 PHI credits. (ME).",
        "title": "Philosophy of Religion",
        "year": "3"
    },
    {
        "code": "PHI3395",
        "description": "Study of the nature and origins of rights and of the foundations of human rights through a survey of the major currents of the philosophy of rights (natural rights, positivism, historicism, Kantianism, utilitarianism) and the study of legal cases.",
        "language": "English",
        "restriction": "Prerequisite: 12 PHI credits including PHI2174 or PHI2183. (EP).",
        "title": "Philosophy of Law",
        "year": "3"
    },
    {
        "code": "PHI3396",
        "description": "Study of the epistemological presuppositions of the social sciences, of the theoretical approaches to sociology (materialism, functionalism, structuralism, hermeneutics and sociobiology) and of the phenomena of Modernity as the fundamental category of sociological thought.",
        "language": "English",
        "restriction": "Prerequisite: 12 PHI credits. (EP).",
        "title": "Philosophy of the Social Sciences",
        "year": "3"
    },
    {
        "code": "PHI3397",
        "description": "Study of major contributors to the development of analytic philosophy from its nineteenth-century origins to the mid-twentieth century. Readings from authors such as Frege, Russell, Carnap and Quine.",
        "language": "English",
        "restriction": "Prerequisite: 15 PHI credits including PHI2170, PHI2383. Previously PHI3378. (ME).",
        "title": "Origins of Analytic Philosophy",
        "year": "3"
    },
    {
        "code": "PHI3398",
        "description": "Study of major debates and currents in analytic philosophy, with focus on the core theoretical areas of philosophy of mind, philosophy of language, epistemology and metaphysics.",
        "language": "English",
        "restriction": "Prerequisite: 15 PHI credits including PHI2170, PHI2383. Previously PHI3378. (ME).",
        "title": "Contemporary Analytic Philosophy",
        "year": "3"
    },
    {
        "code": "PHI3505",
        "description": "La phénoménologie comme tentative de dépassement de la distinction entre être et apparaître par un retour aux choses elles-mêmes et le développement d'une nouvelle méthode descriptive. Études de textes des précurseurs, de Husserl et de ses suites, de Heidegger à la phénoménologie française.",
        "language": "French",
        "restriction": "Préalable : 12 crédits PHI incluant PHI2783. (ME).",
        "title": "La Phénoménologie",
        "year": "3"
    },
    {
        "code": "PHI3508",
        "description": "Étude de textes de philosophes des 17e et 18e siècles, dont Descartes, Leibniz, Spinoza, Malebranche, Locke, Berkeley, Hume.",
        "language": "French",
        "restriction": "Préalables : 12 crédits PHI incluant PHI2783. (HP). Ce cours à thèmes variables peut être suivi plusieurs fois pourvu que les thèmes diffèrent.",
        "title": "Textes en philosophie moderne",
        "year": "3"
    },
    {
        "code": "PHI3525",
        "description": "Une initiation à quelques-unes des questions philosophiques soulevées par les sciences cognitives, soit l'étude interdisciplinaire de l'esprit qui englobe l'informatique, la linguistique, les neurosciences, la philosophie et la psychologie.",
        "language": "French",
        "restriction": "",
        "title": "Philosophie des sciences cognitives",
        "year": "3"
    },
    {
        "code": "PHI3564",
        "description": "Étude de questions en méta-éthique. Les fondements métaphysiques et épistémologiques de théories normatives contemporaines.",
        "language": "French",
        "restriction": "Préalables : 12 crédits PHI incluant PHI2574. (EP). Ce cours à thèmes variables peut être suivi plusieurs fois pourvu que les thèmes diffèrent.",
        "title": "Théories éthiques contemporaines",
        "year": "3"
    },
    {
        "code": "PHI3570",
        "description": "Analyse du concept de connaissance et des distinctions entre connaissance a priori et a posteriori, entre analytique et synthétique. Étude de questions relatives à la possibilité d'une connaissance du monde extérieur et au défi du scepticisme ainsi que du débat entre rationalisme et empirisme.",
        "language": "French",
        "restriction": "Préalables : 15 crédits PHI incluant PHI2570, PHI2783. Ce cours à thèmes variables peut être suivi plusieurs fois pourvu que les thèmes diffèrent.s.",
        "title": "Thèmes choisis en théorie de la connaissance",
        "year": "3"
    },
    {
        "code": "PHI3571",
        "description": "Étude de sujets tels que la théorie de la quantification, les systèmes axiomatiques, la métathéorie de la logique du premier ordre avec les théorèmes de validité et de complétude, la théorie des modèles, et les théorèmes d'incomplétude de G del.",
        "language": "French",
        "restriction": "Préalables : PHI2570, six crédits PHI au niveau 1000 et trois autres crédits PHI au niveau 2000. Antérieurement PHI2571. (ME).",
        "title": "Logique II",
        "year": "3"
    },
    {
        "code": "PHI3574",
        "description": "Étude des questions relatives à la structure de la réalité, aux questions relatives aux concepts fondamentaux de temps, d'espace, de cause et d'identité, et au débat entre réalisme et idéalisme.",
        "language": "French",
        "restriction": "Préalables : 15 crédits PHI incluant PHI2570, PHI2783. Ce cours à thèmes variables peut être suivi plusieurs fois pourvu que les thèmes diffèrent.",
        "title": "Thèmes choisis en métaphysique",
        "year": "3"
    },
    {
        "code": "PHI3770",
        "description": "Introduction à la philosophie de Platon à travers une lecture des dialogues représentant la diversité de styles, de méthodes et d'idées.",
        "language": "French",
        "restriction": "Préalable : 12 crédits PHI dont PHI2780. Aussi offert sous la cote CLA3770. (HP).",
        "title": "Platon. Le philosophe comme poète, amant, dialecticien et roi",
        "year": "3"
    },
    {
        "code": "PHI3777",
        "description": "Examen des principaux courants de la philosophie européenne au XXe siècle: existentialisme, phénoménologie, herméneutique, théorie critique, structuralisme et poststructuralisme.",
        "language": "French",
        "restriction": "Préalable : 15 crédits PHI incluant PHI2783. (ME).",
        "title": "Philosophie continentale contemporaine",
        "year": "3"
    },
    {
        "code": "PHI3780",
        "description": "Introduction à la philosophie d'Aristote à travers la lecture de textes relatifs à la psychologie, la logique, la physique, la métaphysique, l'éthique et la politique.",
        "language": "French",
        "restriction": "Préalable : 12 crédits PHI incluant PHI2780. Aussi offert sous la cote CLA3780. (HP).",
        "title": "Aristote. La recherche de la sagesse",
        "year": "3"
    },
    {
        "code": "PHI3782",
        "description": "Kant et la pensée de l'autonomie de l'être humain, c'est-à-dire la possibilité de découvrir les principes de la raison et de l'action par notre seule raison. Introduction à sa philosophie par la lecture de la \"Critique de la raison pure\", où sont posées une théorie de la connaissance et une critique de la métaphysique.",
        "language": "French",
        "restriction": "Préalable : 12 crédits PHI incluant PHI2783. (HP).",
        "title": "Kant et la philosophie critique",
        "year": "3"
    },
    {
        "code": "PHI3786",
        "description": "Étude de philosophes-clés du XIXe siècle, tels que Fichte, Schelling, Hegel, Schopenhauer, Darwin, Kierkegaard, Marx, Nietzsche et Mach.",
        "language": "French",
        "restriction": "Préalables : 12 crédits PHI incluant PHI2783. (HP). Ce cours à thèmes variables peut être suivi plusieurs fois pourvu que les thèmes diffèrent.",
        "title": "Thèmes choisis en philosophie du 19e siècle",
        "year": "3"
    },
    {
        "code": "PHI3787",
        "description": "Le mot d'ordre des Lumières : penser par soi-même. Étude des thèmes qui en découlent : l'autonomie de la raison, la liberté de pensée, la tolérance, la critique de la religion, le naturalisme, l'universalisme. Étude d'auteurs tels que Locke, Hume, Burke, Smith, Montesquieu, Rousseau, Voltaire, Kant, Lessing.",
        "language": "French",
        "restriction": "Préalable : 12 crédits PHI incluant PHI2783. (HP).",
        "title": "La philosophie des Lumières",
        "year": "3"
    },
    {
        "code": "PHI3790",
        "description": "Extensions et alternatives à la logique classique du premier ordre, telles que la logique du deuxième ordre, la théorie des types, la conséquence logique, la logique modale, et les logiques de plusieurs valeurs, constructivistes ou paracohérentes. Étude de questions de logique philosophique telles que les théories de la vérité, les conditionnelles et les paradoxes.",
        "language": "French",
        "restriction": "Préalables : PHI2570, six crédits PHI au niveau 1000 et trois autres crédits PHI au niveau 2000. Antérieurement PHI2571. (ME).",
        "title": "Logique philosophique",
        "year": "3"
    },
    {
        "code": "PHI3791",
        "description": "Étude de thèmes communs à la linguistique et à la philosophie du langage. L'approche formelle de la syntaxe et de la sémantique et les courants actuels en pragmatique. Étude des questions relatives à l'épistémologie de la linguistique, des questions d'ordre cognitif (rapport langage-pensée) et ontologique (rapport langage-monde).",
        "language": "French",
        "restriction": "Préalable : 12 crédits PHI incluant PHI2570. Aussi offert sous la cote LIN3771. (ME).",
        "title": "Philosophie du langage",
        "year": "3"
    },
    {
        "code": "PHI3793",
        "description": "Étude des diverses justifications et critiques philosophiques de l'expérience religieuse, des problèmes liés à l'idée d'un être transcendant et du problème du mal. Lecture d'auteurs tels que Thomas D'Aquin, Pascal, Kant, Hegel, Feuerbach, Kierkegaard, Nietzsche, Freud, James.",
        "language": "French",
        "restriction": "Préalable : 12 crédits PHI. (ME).",
        "title": "Philosophie de la religion",
        "year": "3"
    },
    {
        "code": "PHI3795",
        "description": "Étude de la nature et de l'origine du droit, des fondements des droits de l'être humain par l'examen des principaux courants de la philosophie du droit (jusnaturalisme, positivisme, historicisme, kantisme, utilitarisme) et l'examen de cas juridiques.",
        "language": "French",
        "restriction": "Préalable : 12 crédits PHI incluant PHI2574 ou PHI2583. (EP).",
        "title": "Philosophie du droit",
        "year": "3"
    },
    {
        "code": "PHI3796",
        "description": "Étude des présupposés épistémologiques des sciences sociales et des approches théoriques de la sociologie (matérialisme, fonctionnalisme, structuralisme, herméneutique et sociobiologie) et du phénomène de la modernité comme catégorie première de la réflexion sociologique.",
        "language": "French",
        "restriction": "Préalable : 12 crédits PHI. (EP).",
        "title": "Philosophie des sciences sociales",
        "year": "3"
    },
    {
        "code": "PHI3797",
        "description": "Étude d'auteurs qui ont joué un rôle important dans le développement de la philosophie analytique dès son commencement au XIXe siècle jusqu'à 1950. Lecture d'auteurs tels que Frege, Russell, Carnap, Quine.",
        "language": "French",
        "restriction": "Préalable : 15 crédits PHI incluant PHI2570, PHI2783. Antérieurement PHI3778. (ME).",
        "title": "Origines de la philosophie analytique",
        "year": "3"
    },
    {
        "code": "PHI3798",
        "description": "Étude des débats et mouvements importants en philosophie analytique contemporaine, particulièrement dans les domaines de la philosophie de l'esprit, la philosophie du langage, la théorie de la connaissance, et la métaphysique.",
        "language": "French",
        "restriction": "Préalable : 15 crédits PHI incluant PHI2570, PHI2783. Antérieurement PHI3778. (ME).",
        "title": "Philosophie analytique contemporaine",
        "year": "3"
    },
    {
        "code": "PHI4160",
        "description": "A close and focused reading of one or more key texts in Ancient Greek Philosophy. Instead of simply being presented with a philosopher's 'ideas' or 'system', the student will learn to read some of the most important and difficult texts in the history of philosophy. The students will read these texts with sufficient sensitivity to style and sufficient attention to the details of the argument to appreciate their complexity and ambiguity and to engage their ideas critically.",
        "language": "English",
        "restriction": "Prerequisite: 21 PHI credits. PHI 4000-level course content varies from year to year.",
        "title": "Greek Philosophical Texts",
        "year": "4"
    },
    {
        "code": "PHI4164",
        "description": "Advanced study of contemporary normative theory. Recent debates, such as those involving utilitarianism, virtue ethics, deontological ethics.",
        "language": "English",
        "restriction": "Prerequisite: 21 PHI credits including PHI2174. PHI 4000-level course content varies from year to year. (EP).",
        "title": "Seminar in Ethics",
        "year": "4"
    },
    {
        "code": "PHI4307",
        "description": "Study of one or more of the major currents in 19th-and 20th-century French philosophy, such as utopism, positivism, reflexive philosophy, existentialism, structuralism and post-modernism.",
        "language": "English",
        "restriction": "Prerequisite: 21 PHI credits. PHI 4000-level course content varies from year to year. HP.",
        "title": "Texts in French Philosophy",
        "year": "4"
    },
    {
        "code": "PHI4308",
        "description": "Readings of representatives of the major currents of American philosophy in the 19th and 20th centuries, such as pragmatism (Pierce, James, Dewey) and Analytical Philosophy (Quine, Putnam, Kripke, Davidson).",
        "language": "English",
        "restriction": "Prerequisite: 21 PHI credits. PHI 4000-level course content varies from year to year. ME.",
        "title": "Texts in American Philosophy",
        "year": "4"
    },
    {
        "code": "PHI4309",
        "description": "Study of Wittgenstein's thoughts on logic, language and mind, of his principal arguments such as those on private language and following a rule, and of key notions such as that of language-game.",
        "language": "English",
        "restriction": "Prerequisite: 21 PHI credits. PHI 4000-level course content varies from year to year. ME.",
        "title": "Wittgenstein",
        "year": "4"
    },
    {
        "code": "PHI4311",
        "description": "Analysis of current debates such as those concerning liberalism vs cultural diversity, social justice, and the critique of liberal democracy. Readings from authors such as Rawls, Habermas, Taylor.",
        "language": "English",
        "restriction": "Prerequisites: 21 PHI credits including PHI2183. PHI 4000-level course content varies from year to year. EP.",
        "title": "Problems in Contemporary Political Philosophy",
        "year": "4"
    },
    {
        "code": "PHI4312",
        "description": "Ethics as it faces the challenges of relativism and scepticism, and the problems linked with new developments in science and information technologies. Study of major currents of contemporary ethics such as the ethics of discussion (Habermas, Apel), utilitarianism (Singer), the ethics of responsibility (Jonas), the ethics of virtue (MacIntyre).",
        "language": "English",
        "restriction": "Prerequisite: 21 PHI credits including PHI2174. PHI 4000-level course content varies from year to year. (EP).",
        "title": "Problems in Contemporary Ethics",
        "year": "4"
    },
    {
        "code": "PHI4384",
        "description": "Readings of philosophical texts not covered in the program.",
        "language": "English",
        "restriction": "Prerequisite: 21 PHI credits. PHI 4000-level course content varies from year to year.",
        "title": "Philosophical Texts",
        "year": "4"
    },
    {
        "code": "PHI4385",
        "description": "Hegel's absolute idealism as a synthesis of the systems of Fichte and Schelling. Study of the \"Phenomenology of Spirit\" and the movement of the experience of consciousness towards \"absolute knowledge\", within which a logic, a philosophy of nature, a philosophy of mind and an influential philosophy of right are developed.",
        "language": "English",
        "restriction": "Prerequisite: 21 PHI credits. PHI 4000-level course content varies from year to year. Previously: PHI3383. HP.",
        "title": "Hegel and German Idealism",
        "year": "4"
    },
    {
        "code": "PHI4396",
        "description": "Study of philosophical topics not covered in the program.",
        "language": "English",
        "restriction": "Prerequisite: 21 PHI credits. PHI 4000-level course content varies from year to year.",
        "title": "Philosophical Questions",
        "year": "4"
    },
    {
        "code": "PHI4560",
        "description": "Une lecture attentive et précise d'un ou de plusieurs textes en philosophie grecque ancienne. Au lieu de se voir présenter les idées ou le système d'un philosophe, il s'agira pour l'étudiant d'apprendre à lire les textes les plus importants et les plus difficiles dans l'histoire de la philosophie avec une sensibilité au style et une attention particulière au détail de l'argumentation. Cette lecture lui permettra d'apprécier la complexité et l'ambiguïté de ces textes permettant un engagement critique avec les idées développées dans ces textes.",
        "language": "French",
        "restriction": "Préalable : 21 crédits PHI. Le contenu des cours de niveau 4000 varie chaque année.",
        "title": "Textes philosophiques grecs",
        "year": "4"
    },
    {
        "code": "PHI4564",
        "description": "Étude avancée de théories normatives contemporaines. Débats récents autour de théories telles que l'utilitarisme, l'éthique de la vertu, l'éthique déontologique.",
        "language": "French",
        "restriction": "Préalable : 21 crédits PHI incluant PHI2574. Le contenu des cours de niveau 4000 varie chaque année. (EP).",
        "title": "Séminaire en éthique",
        "year": "4"
    },
    {
        "code": "PHI4707",
        "description": "Étude d'un ou de plusieurs des principaux courants de la philosophie française aux 19e et 20e siècles, tels que l'utopisme, le positivisme, la philosophie réflexive, l'existentialisme, le structuralisme et le postmodernisme.",
        "language": "French",
        "restriction": "Préalable : 21 crédits PHI. Le contenu des cours de niveau 4000 varie chaque année. HP.",
        "title": "Textes en philosophie française",
        "year": "4"
    },
    {
        "code": "PHI4708",
        "description": "Études d'auteurs représentant les grands courants de la philosophie américaine aux 19e et 20e siècles, tels que le pragmatisme (Pierce, James, Dewey) et la philosophie analytique (Quine, Putnam, Kripke, Davidson).",
        "language": "French",
        "restriction": "Préalable : 21 crédits PHI. Le contenu des cours de niveau 4000 varie chaque année. ME.",
        "title": "Textes en philosophie américaine",
        "year": "4"
    },
    {
        "code": "PHI4709",
        "description": "Étude de la pensée de Wittgenstein sur la logique, le langage et l'esprit, de ses principaux arguments tels sur le langage privé et suivre une règle, ainsi que de notions-clés telles que celle de jeu de langage.",
        "language": "French",
        "restriction": "Préalable : 21 crédits PHI. Le contenu des cours de niveau 4000 varie chaque année. ME.",
        "title": "Wittgenstein",
        "year": "4"
    },
    {
        "code": "PHI4711",
        "description": "Analyse de débats contemporains tels que ceux du libéralisme face à la diversité culturelle, de la justice sociale et de la critique de la démocratie libérale. Lecture d'auteurs tels que Rawls, Habermas, Taylor.",
        "language": "French",
        "restriction": "Préalables : 21 crédits PHI dont PHI2583. Le contenu des cours de niveau 4000 varie chaque année. EP.",
        "title": "Problèmes de philosophie politique contemporaine",
        "year": "4"
    },
    {
        "code": "PHI4712",
        "description": "L'éthique face aux défis du relativisme et du scepticisme et aux problèmes liés aux récents développements des sciences et des technologies de l'information. Étude des principaux courants contemporains, tels que l'éthique de la discussion (Habermas, Apel), l'utilitarisme (Singer), l'éthique de la responsabilité (Jonas) et les éthiques de la vertu (MacIntyre).",
        "language": "French",
        "restriction": "Préalable : 21 crédits PHI incluant PHI2574. Le contenu des cours de niveau 4000 varie chaque année. (EP).",
        "title": "Problèmes d'éthique contemporaine",
        "year": "4"
    },
    {
        "code": "PHI4784",
        "description": "Lecture de textes philosophiques qui ne figurent pas au programme.",
        "language": "French",
        "restriction": "Préalable : 21 crédits PHI. Le contenu des cours de niveau 4000 varie chaque année.",
        "title": "Textes philosophiques",
        "year": "4"
    },
    {
        "code": "PHI4785",
        "description": "L'idéalisme absolu de Hegel comme synthèse des systèmes de Fichte et Schelling. Étude de la \"Phénoménologie de l'esprit\" et du mouvement de l'expérience de la conscience s'achevant dans un \"savoir absolu\", dans lequel se développent une logique, une philosophie de la nature, une philosophie de l'esprit et une influente philosophie du droit.",
        "language": "French",
        "restriction": "Préalable : 21 crédits PHI. Le contenu des cours de niveau 4000 varie chaque année. Antérieurement : PHI3783. HP.",
        "title": "Hegel et l'idéalisme allemand",
        "year": "4"
    },
    {
        "code": "PHI4796",
        "description": "Étude de problèmes philosophiques qui ne figurent pas au programme.",
        "language": "French",
        "restriction": "Préalable : 21 crédits PHI. Le contenu des cours de niveau 4000 varie chaque année.",
        "title": "Problèmes philosophiques",
        "year": "4"
    }
]